# imobiliária Aluga Rápido

### importação de bibliotecas e funções

In [ ]:
import pandas as pd;
import numpy as np;
from numpy import nan;
from pandas import read_csv, to_numeric

In [ ]:
url="dataset/aluguel.csv";
# read_csv(url,sep=';')

# Variável para guardar o dataset

In [ ]:
dados = read_csv(url,sep=';');
dados

In [ ]:
print(type(url));
print(type(dados));

# Substituindo NaN (not a Number) com 0
## Função head para apresentar as 20 primeiras linhas e tails para mostrar as 10 últimas

In [ ]:
dados = dados.replace(nan, 0);

In [ ]:
dados.head(20)

In [ ]:

dados.tail(10)

In [ ]:
print(type(dados));
type(dados)

In [ ]:
dados.shape

In [1]:
dados.columns

NameError: name 'dados' is not defined

# explorar as diferentes colunas existentes

In [22]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        32960 non-null  object
 1   Bairro      32960 non-null  object
 2   Quartos     32960 non-null  int64
 3   Vagas       32960 non-null  int64
 4   Suites      32960 non-null  int64
 5   Area        32960 non-null  int64
 6   Valor       32960 non-null  float64
 7   Condominio  32960 non-null  float64
 8   IPTU        32960 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

In [23]:
dados['Tipo']

0                      Quitinete
1                           Casa
2        Conjunto Comercial/Sala
3                    Apartamento
4                    Apartamento
                  ...
32955                  Quitinete
32956                Apartamento
32957                Apartamento
32958                Apartamento
32959    Conjunto Comercial/Sala
Name: Tipo, Length: 32960, dtype: object

filtrar 2 colunas

In [24]:
dados[['Quartos','Valor']]

       Quartos   Valor
0            1  1700.0
1            2  7000.0
2            0  5200.0
3            1   800.0
4            1   800.0
...        ...     ...
32955        0   800.0
32956        3  1800.0
32957        2  1400.0
32958        2  3000.0
32959        0  6500.0

[32960 rows x 2 columns]

ferramentas respeitaveis excel,python,java,mysql-workbench

In [ ]:
#codigo que estava fazendo solo

import pandas as pd
import numpy as np
from numpy import nan
from pandas import read_csv, to_numeric



dataset = read_csv("dataset/aluguel.csv", delimiter=';')
dataset = dataset.replace(nan, 0)

# dataset['Quartos']=to_numeric(dataset['Quartos'])
# dataset['Vagas']=to_numeric(dataset['quartos'])

# print(dataset)

url = "C:/Users/ead/Documents/.henrique/Senai-dataset-Inovatech/datascience/dataset/aluguel.csv"
read_csv(url,sep=';')